pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2355.h
/* RTCIV Control Bits */
#define RTCIV0                           (0x0001)        /* Real-time clock interrupt vector value */
#define RTCIV0_L                         (0x0001)
#define RTCIV1                           (0x0002)        /* Real-time clock interrupt vector value */
#define RTCIV1_L                         (0x0002)
#define RTCIV2                           (0x0004)        /* Real-time clock interrupt vector value */
#define RTCIV2_L                         (0x0004)
#define RTCIV3                           (0x0008)        /* Real-time clock interrupt vector value */
#define RTCIV3_L                         (0x0008)
#define RTCIV4                           (0x0010)        /* Real-time clock interrupt vector value */
#define RTCIV4_L                         (0x0010)
#define RTCIV5                           (0x0020)        /* Real-time clock interrupt vector value */
#define RTCIV5_L                         (0x0020)
#define RTCIV6                           (0x0040)        /* Real-time clock interrupt vector value */
#define RTCIV6_L                         (0x0040)
#define RTCIV7                           (0x0080)        /* Real-time clock interrupt vector value */
#define RTCIV7_L                         (0x0080)
#define RTCIV8                           (0x0100)        /* Real-time clock interrupt vector value */
#define RTCIV8_H                         (0x0001)
#define RTCIV9                           (0x0200)        /* Real-time clock interrupt vector value */
#define RTCIV9_H                         (0x0002)
#define RTCIV10                          (0x0400)        /* Real-time clock interrupt vector value */
#define RTCIV10_H                        (0x0004)
#define RTCIV11                          (0x0800)        /* Real-time clock interrupt vector value */
#define RTCIV11_H                        (0x0008)
#define RTCIV12                          (0x1000)        /* Real-time clock interrupt vector value */
#define RTCIV12_H                        (0x0010)
#define RTCIV13                          (0x2000)        /* Real-time clock interrupt vector value */
#define RTCIV13_H                        (0x0020)
#define RTCIV14                          (0x4000)        /* Real-time clock interrupt vector value */
#define RTCIV14_H                        (0x0040)
#define RTCIV15                          (0x8000)        /* Real-time clock interrupt vector value */
#define RTCIV15_H                        (0x0080)
#define RTCIV_0                          (0x0000)        /* No interrupt pending */
#define RTCIV_2                          (0x0002)        /* upt Source: RTC Counter Overflow; Interrupt Flag: RTCIFG */
#define RTCIV_2_L                        (0x0002)
#define RTCIV__NONE                      (0x0000)        /* No interrupt pending */
#define RTCIV__RTCIFG                    (0x0002)        /* upt Source: RTC Counter Overflow; Interrupt Flag: RTCIFG */
#define RTCIV__RTCIFG_L                  (0x0002)


/*****************************************************************************
 SAC0 Registers
*****************************************************************************/

#define __MSP430_HAS_SAC0__                   /* Definition to show that module is available */
#ifndef __MSP430_HAS_SACx__
#define __MSP430_HAS_SACx__
#endif
#define __MSP430_BASEADDRESS_SAC0__ 0x0C80
#define SAC0_BASE              __MSP430_BASEADDRESS_SAC0__
#define __MSP430_HAS_SAC0_CONFIG__ 3          /* Definition to show the Module config */
#ifndef __MSP430_HAS_SACx_CONFIG_3__
#define __MSP430_HAS_SACx_CONFIG_3__
#endif

sfr_w(SAC0OA);                                /* SAC OA Control Register */
sfr_b(SAC0OA_L);
sfr_b(SAC0OA_H);
sfr_w(SAC0PGA);                               /* SAC PGA Control Register */
sfr_b(SAC0PGA_L);
sfr_b(SAC0PGA_H);
sfr_w(SAC0DAC);                               /* SAC DAC Control Register */
sfr_b(SAC0DAC_L);
sfr_b(SAC0DAC_H);
sfr_w(SAC0DAT);                               /* SAC DAC Data Register */
sfr_b(SAC0DAT_L);
sfr_b(SAC0DAT_H);
sfr_w(SAC0DACSTS);                            /* SAC DAC Status Register */
sfr_b(SAC0DACSTS_L);
sfr_b(SAC0DACSTS_H);
sfr_w(SAC0IV);                                /* SAC Interrupt Vector Register */
sfr_b(SAC0IV_L);
sfr_b(SAC0IV_H);

/* SAC0 Register Offsets */
#define OFS_SAC0OA                       (0x0000)
#define OFS_SAC0OA_L                     OFS_SAC0OA
#define OFS_SAC0OA_H                     OFS_SAC0OA+1
#define OFS_SAC0PGA                      (0x0002)
#define OFS_SAC0PGA_L                    OFS_SAC0PGA
#define OFS_SAC0PGA_H                    OFS_SAC0PGA+1
#define OFS_SAC0DAC                      (0x0004)
#define OFS_SAC0DAC_L                    OFS_SAC0DAC
#define OFS_SAC0DAC_H                    OFS_SAC0DAC+1
#define OFS_SAC0DAT                      (0x0006)
#define OFS_SAC0DAT_L                    OFS_SAC0DAT
#define OFS_SAC0DAT_H                    OFS_SAC0DAT+1
#define OFS_SAC0DACSTS                   (0x0008)
#define OFS_SAC0DACSTS_L                 OFS_SAC0DACSTS
#define OFS_SAC0DACSTS_H                 OFS_SAC0DACSTS+1
#define OFS_SAC0IV                       (0x000A)
#define OFS_SAC0IV_L                     OFS_SAC0IV
#define OFS_SAC0IV_H                     OFS_SAC0IV+1

/* SAC0 Control Bits */

/* SAC0OA Control Bits */
#define PSEL                             (0x0003)        /* SAC OA Positive input source selection */
#define PSEL_L                           (0x0003)
#define PSEL0                            (0x0001)        /* SAC OA Positive input source selection */
#define PSEL0_L                          (0x0001)
#define PSEL1                            (0x0002)        /* SAC OA Positive input source selection */
#define PSEL1_L                          (0x0002)
#define PSEL_0                           (0x0000)        /* External source selected */
#define PSEL_1                           (0x0001)        /* 12-bit reference DAC source selected */
#define PSEL_1_L                         (0x0001)
#define PSEL_2                           (0x0002)        /* Pair OA source selected */
#define PSEL_2_L                         (0x0002)
#define PMUXEN                           (0x0008)        /* SAC Positive input MUX control. */
#define PMUXEN_L                         (0x0008)
#define PMUXEN_0                         (0x0000)        /* All positive input sources are disconnected to OA positive 
                                                            port */
#define PMUXEN_1                         (0x0008)        /* All positive input sources are connected to OA positive port */
#define PMUXEN_1_L                       (0x0008)
#define NSEL                             (0x0030)        /* SAC OA Negative input source selection */
#define NSEL_L                           (0x0030)
#define NSEL0                            (0x0010)        /* SAC OA Negative input source selection */
#define NSEL0_L                          (0x0010)
#define NSEL1                            (0x0020)        /* SAC OA Negative input source selection */
#define NSEL1_L                          (0x0020)
#define NSEL_0                           (0x0000)        /* External source selected */
#define NSEL_1                           (0x0010)        /* PGA source selected */
#define NSEL_1_L                         (0x0010)
#define NSEL_2                           (0x0020)        /* Device Specific */
#define NSEL_2_L                         (0x0020)
#define NMUXEN                           (0x0080)        /* SAC Negative input MUX controL */
#define NMUXEN_L                         (0x0080)
#define NMUXEN_0                         (0x0000)        /* All negative input sources are disconnected to OA negative 
                                                            port */
#define NMUXEN_1                         (0x0080)        /* All negative input sources are connected to OA negative port */
#define NMUXEN_1_L                       (0x0080)
#define OAEN                             (0x0100)        /* SAC OA Enable selection */
#define OAEN_H                           (0x0001)
#define OAEN_0                           (0x0000)        /* SAC OA is disabled, then the SAC OA output high impedance */
#define OAEN_1                           (0x0100)        /* SAC OA is enabled, normal mode */
#define OAEN_1_H                         (0x0001)
#define OAPM                             (0x0200)        /* SAC OA power mode selection */
#define OAPM_H                           (0x0002)
#define OAPM_0                           (0x0000)        /* High speed and high power */
#define OAPM_1                           (0x0200)        /* Llow speed and low power */
#define OAPM_1_H                         (0x0002)
#define SACEN                            (0x0400)        /* SAC Enable selection */
#define SACEN_H                          (0x0004)
#define SACEN_0                          (0x0000)        /* SAC all modules are disabled, then the SAC output high 
                                                            impedance */
#define SACEN_1                          (0x0400)        /* SAC all modules are enabled, normal mode */
#define SACEN_1_H                        (0x0004)

/* SAC0PGA Control Bits */
#define MSEL                             (0x0003)        /* SAC PGA Mode Selection */
#define MSEL_L                           (0x0003)
#define MSEL0                            (0x0001)        /* SAC PGA Mode Selection */
#define MSEL0_L                          (0x0001)
#define MSEL1                            (0x0002)        /* SAC PGA Mode Selection */
#define MSEL1_L                          (0x0002)
#define MSEL_0                           (0x0000)        /* Inverting PGA mode (external pad IN- is selected) */
#define MSEL_1                           (0x0001)        /* Buffer mode (floating is selected ) */
#define MSEL_1_L                         (0x0001)
#define MSEL_2                           (0x0002)        /* Non-inverting mode */
#define MSEL_2_L                         (0x0002)
#define MSEL_3                           (0x0003)        /* Cascade OA Inverting mode */
#define MSEL_3_L                         (0x0003)
#define GAIN                             (0x0070)        /* SAC PGA Gain configuration */
#define GAIN_L                           (0x0070)
#define GAIN0                            (0x0010)        /* SAC PGA Gain configuration */
#define GAIN0_L                          (0x0010)
#define GAIN1                            (0x0020)        /* SAC PGA Gain configuration */
#define GAIN1_L                          (0x0020)
#define GAIN2                            (0x0040)        /* SAC PGA Gain configuration */
#define GAIN2_L                          (0x0040)

