pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2355.h
/* SAC0DAC Control Bits */
#define DACEN                            (0x0001)        /* SAC DAC enable */
#define DACEN_L                          (0x0001)
#define DACEN_0                          (0x0000)        /* Disabled */
#define DACEN_1                          (0x0001)        /* Enabled */
#define DACEN_1_L                        (0x0001)
#define DACIE                            (0x0002)        /* SAC DAC interrupt enable */
#define DACIE_L                          (0x0002)
#define DACIE_0                          (0x0000)        /* Disabled */
#define DACIE_1                          (0x0002)        /* Enabled */
#define DACIE_1_L                        (0x0002)
#define DACDMAE                          (0x0004)        /* SAC DAC DMA request enable */
#define DACDMAE_L                        (0x0004)
#define DACDMAE_0                        (0x0000)        /* DMA request disabled */
#define DACDMAE_1                        (0x0004)        /* DMA request enabled */
#define DACDMAE_1_L                      (0x0004)
#define DACLSEL                          (0x0300)        /* SAC DAC load select. Selects the load trigger for the DAC 
                                                            latch. */
#define DACLSEL_H                        (0x0003)
#define DACLSEL0                         (0x0100)        /* SAC DAC load select. Selects the load trigger for the DAC 
                                                            latch. */
#define DACLSEL0_H                       (0x0001)
#define DACLSEL1                         (0x0200)        /* SAC DAC load select. Selects the load trigger for the DAC 
                                                            latch. */
#define DACLSEL1_H                       (0x0002)
#define DACLSEL_0                        (0x0000)        /* DAC latch loads when DACDAT written */
#define DACLSEL_2                        (0x0200)        /* Device specific 0. DAC always loads data from DACDAT at the 
                                                            positive edge of this signal */
#define DACLSEL_2_H                      (0x0002)
#define DACLSEL_3                        (0x0300)        /* Device specific 1. DAC always loads data from DACDAT at the 
                                                            positive edge of this signal */
#define DACLSEL_3_H                      (0x0003)
#define DACSREF                          (0x1000)        /* SAC DAC select reference voltage */
#define DACSREF_H                        (0x0010)
#define DACSREF_0                        (0x0000)        /* AVCC */
#define DACSREF_1                        (0x1000)        /* Alternative reference */
#define DACSREF_1_H                      (0x0010)

/* SAC0DAT Control Bits */
#define DACDATA                          (0x0fff)        /* SAC DAC data in unsigned format. */
#define DACDATA_L                        (0x00ff)
#define DACDATA_H                        (0x000f)
#define DACDATA0                         (0x0001)        /* SAC DAC data in unsigned format. */
#define DACDATA0_L                       (0x0001)
#define DACDATA1                         (0x0002)        /* SAC DAC data in unsigned format. */
#define DACDATA1_L                       (0x0002)
#define DACDATA2                         (0x0004)        /* SAC DAC data in unsigned format. */
#define DACDATA2_L                       (0x0004)
#define DACDATA3                         (0x0008)        /* SAC DAC data in unsigned format. */
#define DACDATA3_L                       (0x0008)
#define DACDATA4                         (0x0010)        /* SAC DAC data in unsigned format. */
#define DACDATA4_L                       (0x0010)
#define DACDATA5                         (0x0020)        /* SAC DAC data in unsigned format. */
#define DACDATA5_L                       (0x0020)
#define DACDATA6                         (0x0040)        /* SAC DAC data in unsigned format. */
#define DACDATA6_L                       (0x0040)
#define DACDATA7                         (0x0080)        /* SAC DAC data in unsigned format. */
#define DACDATA7_L                       (0x0080)
#define DACDATA8                         (0x0100)        /* SAC DAC data in unsigned format. */
#define DACDATA8_H                       (0x0001)
#define DACDATA9                         (0x0200)        /* SAC DAC data in unsigned format. */
#define DACDATA9_H                       (0x0002)
#define DACDATA10                        (0x0400)        /* SAC DAC data in unsigned format. */
#define DACDATA10_H                      (0x0004)
#define DACDATA11                        (0x0800)        /* SAC DAC data in unsigned format. */
#define DACDATA11_H                      (0x0008)

/* SAC0DACSTS Control Bits */
#define DACIFG                           (0x0001)        /* SAC DAC data update flag */
#define DACIFG_L                         (0x0001)

/* SAC0IV Control Bits */
#define SACIV0                           (0x0001)        /* SACIV Bit 0 */
#define SACIV0_L                         (0x0001)
#define SACIV1                           (0x0002)        /* SACIV Bit 1 */
#define SACIV1_L                         (0x0002)
#define SACIV2                           (0x0004)        /* SACIV Bit 2 */
#define SACIV2_L                         (0x0004)
#define SACIV3                           (0x0008)        /* SACIV Bit 3 */
#define SACIV3_L                         (0x0008)
#define SACIV4                           (0x0010)        /* SACIV Bit 4 */
#define SACIV4_L                         (0x0010)
#define SACIV5                           (0x0020)        /* SACIV Bit 5 */
#define SACIV5_L                         (0x0020)
#define SACIV6                           (0x0040)        /* SACIV Bit 6 */
#define SACIV6_L                         (0x0040)
#define SACIV7                           (0x0080)        /* SACIV Bit 7 */
#define SACIV7_L                         (0x0080)
#define SACIV8                           (0x0100)        /* SACIV Bit 8 */
#define SACIV8_H                         (0x0001)
#define SACIV9                           (0x0200)        /* SACIV Bit 9 */
#define SACIV9_H                         (0x0002)
#define SACIV10                          (0x0400)        /* SACIV Bit 10 */
#define SACIV10_H                        (0x0004)
#define SACIV11                          (0x0800)        /* SACIV Bit 11 */
#define SACIV11_H                        (0x0008)
#define SACIV12                          (0x1000)        /* SACIV Bit 12 */
#define SACIV12_H                        (0x0010)
#define SACIV13                          (0x2000)        /* SACIV Bit 13 */
#define SACIV13_H                        (0x0020)
#define SACIV14                          (0x4000)        /* SACIV Bit 14 */
#define SACIV14_H                        (0x0040)
#define SACIV15                          (0x8000)        /* SACIV Bit 15 */
#define SACIV15_H                        (0x0080)
#define SACIV                            (0xffff)        /* SAC Interrupt Vector Register */
#define SACIV_L                          (0x00ff)
#define SACIV_H                          (0x00ff)
#define SACIV_0                          (0x0000)        /* No interrupt pending */
#define SACIV_2                          (0x0002)        /* S&H completed interrupt flag (Highest priority) */
#define SACIV_2_L                        (0x0002)
#define SACIV_4                          (0x0004)        /* DAC channel update interrupt flag */
#define SACIV_4_L                        (0x0004)


/*****************************************************************************
 SAC1 Registers
*****************************************************************************/

#define __MSP430_HAS_SAC1__                   /* Definition to show that module is available */
#ifndef __MSP430_HAS_SACx__
#define __MSP430_HAS_SACx__
#endif
#define __MSP430_BASEADDRESS_SAC1__ 0x0C90
#define SAC1_BASE              __MSP430_BASEADDRESS_SAC1__
#define __MSP430_HAS_SAC1_CONFIG__ 3          /* Definition to show the Module config */
#ifndef __MSP430_HAS_SACx_CONFIG_3__
#define __MSP430_HAS_SACx_CONFIG_3__
#endif

sfr_w(SAC1OA);                                /* SAC OA Control Register */
sfr_b(SAC1OA_L);
sfr_b(SAC1OA_H);
sfr_w(SAC1PGA);                               /* SAC PGA Control Register */
sfr_b(SAC1PGA_L);
sfr_b(SAC1PGA_H);
sfr_w(SAC1DAC);                               /* SAC DAC Control Register */
sfr_b(SAC1DAC_L);
sfr_b(SAC1DAC_H);
sfr_w(SAC1DAT);                               /* SAC DAC Data Register */
sfr_b(SAC1DAT_L);
sfr_b(SAC1DAT_H);
sfr_w(SAC1DACSTS);                            /* SAC DAC Status Register */
sfr_b(SAC1DACSTS_L);
sfr_b(SAC1DACSTS_H);
sfr_w(SAC1IV);                                /* SAC Interrupt Vector Register */
sfr_b(SAC1IV_L);
sfr_b(SAC1IV_H);

/* SAC1 Register Offsets */
#define OFS_SAC1OA                       (0x0000)
#define OFS_SAC1OA_L                     OFS_SAC1OA
#define OFS_SAC1OA_H                     OFS_SAC1OA+1
#define OFS_SAC1PGA                      (0x0002)
#define OFS_SAC1PGA_L                    OFS_SAC1PGA
#define OFS_SAC1PGA_H                    OFS_SAC1PGA+1
#define OFS_SAC1DAC                      (0x0004)
#define OFS_SAC1DAC_L                    OFS_SAC1DAC
#define OFS_SAC1DAC_H                    OFS_SAC1DAC+1
#define OFS_SAC1DAT                      (0x0006)
#define OFS_SAC1DAT_L                    OFS_SAC1DAT
#define OFS_SAC1DAT_H                    OFS_SAC1DAT+1
#define OFS_SAC1DACSTS                   (0x0008)
#define OFS_SAC1DACSTS_L                 OFS_SAC1DACSTS
#define OFS_SAC1DACSTS_H                 OFS_SAC1DACSTS+1
#define OFS_SAC1IV                       (0x000A)
#define OFS_SAC1IV_L                     OFS_SAC1IV
#define OFS_SAC1IV_H                     OFS_SAC1IV+1

